Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །དེ་ལ་བྱེ་བྲག་ཏུ་བརྗོད་པར་འདོད་པ་ལ། དང་པོ་ནི་རྩོལ་བ་དང་བཅས་མཚན་མ་དང་བཅས་པའི་གནས་སྐབས་ཀྱི་སྤྱོད་པའོ། །ས་དང་པོ་ཡན་ཆད་ནི་རྩོལ་བ་དང་བཅས་ལ། མཚན་མ་མེད་པའི་གནས་སྐབས་ཀྱི་མངོན་པར་སྒྲུབ་པའོ། །ས་བརྒྱད་པ་ཡན་ཆད་ནི་ལྷུན་གྱིས་གྲུབ་ཅིང་མཚན་མ་མེད་པའི་གནས་སྐབས་ཀྱི་སྒོམ་པའོ་ཞེས་བསྟན་པའོ།
en: Wanting to give a specific explanation for each of these, it teaches that the first is practice during the period when there is effort and there are causal signs; the accomplishing is from the first level on up during the period when there is effort but there are no causal signs; and the meditation is from the eighth level when it is spontaneous and there are no causal signs. “

source: །སེམས་ཀྱི་རྒྱུན་མ་ཆད་ཅིང་མ་བྲལ་བར་རྗེས་སུ་འབྲེལ་པས་ཞེས་བྱ་བ་ནི་སེམས་རྒྱུན་མ་ཆད་པ་དང་། མ་བྲལ་བ་སྟེ། གང་རྗེས་སུ་འབྲེལ་ཞིང་རྒྱུན་ཆགས་པ་དེས་སེམས་བར་ཆད་མེད་ཅིང་སོ་སོར་མ་གྱེས་པ་དང་། རྗེས་སུ་འབྲེལ་བར་བྱའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: With an unbroken, unseparated stream of connected thoughts one after the other” means they should make that unbroken and unseparated stream of thoughts, which is to say ones that are connected one after the other in a continuum, uninterrupted, undivided into separate ones, and connected together.

source: །ཅི་ནས་ཀྱང་སེམས་དང་སེམས་ལས་བྱུང་བ་རྣམས་མི་རྒྱུ་བ་དེ་ལྟར་བསྒོམ་པར་བྱའོ་ཞེས་བྱ་བ་ནི་གནས་གྱུར་གྱི་བར་དུ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: They “should meditate… in such a way that mind and mental factor dharmas are not set in motion at all” means until the transformation of the basis.

source: །ཅི་ལགས་བསྒོམས་པས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རམ་ཞེས་གསོལ་པ་དང་།
en: Subhūti asks: will those “who have meditated reach the knowledge of all aspects?”

source: རབ་འབྱོར་དེ་ནི་མ་ཡིན་ནོ་ཞེས་བསལ་བ་གསུངས་ཏེ།
en: and the Lord negates that with “no.”

source: རྩོལ་བ་དང་བཅས། རྣམ་པར་རྟོག་པ་དང་བཅས་པའི་གནས་སྐབས་ལ་བྱའོ།
en: Take this with the period when there is effort and thought construction.

source: །མ་བསྒོམས་པས་སམ་ཞེས་གསོལ་ནས།
en: Subhūti asks, “Will they without having meditated?”

source: ཅང་མི་གསུང་བར་གྱུར་པ་དང་། མ་ཡིན་ནོ་ཞེས་བསལ་བ་གསུངས་པའོ།
en: and the Lord is silent, and then negates that with “no.”

source: །བསྒོམས་ཀྱང་བསྒོམས་ལ་མ་བསྒོམས་ཀྱང་བསྒོམས་པས་སམ་ཞེས་གསོལ་པ་དང་།
en: Subhūti asks, “Will they, having meditated when they meditated, and without having meditated when they did not meditate?”

source: སྐྱོན་གཉིས་ཀ་བཤད་ཟིན་པས་གསལ་བ་གསུངས་སོ།
en: Because the two faults have already been explained, the answer is no.

source: །བསྒོམས་པ་ཡང་མ་ལགས་མ་བསྒོམས་པ་ཡང་མ་ལགས་པས་སམ་ཞེས་གསོལ་པ་དང་།
en: The response to, “Will they without having meditated and without having not meditated?”

source: གལ་གཉིས་སུ་སྨྲ་བའི་གཞུང་གིས་འཁྲུགས་སུ་དོགས་པས་བསལ་བ་གསུངས་ཏེ། རྣམ་པ་ཐམས་ཅད་དུ་བརྗོད་དུ་མེད་ཅིང་བསམ་གྱིས་མི་ཁྱབ་པའི་གནས་སྐབས་ཡིན་པར་བསྟན་ཏོ།
en: eliminates that because the passages propounding the two main options could have raised a doubt, so it teaches that it is a totally inexpressible and inconceivable state. “

source: །རབ་འབྱོར་དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་བཞིན་ཞེས་བྱ་བ་ནི་ཕྱིས་ཆོས་ཐམས་ཅད་མི་དམིགས་པའི་གནས་སུ་བསྟན་པ་སྟེ། བདག་གི་ཁམས་ཇི་ལྟ་བ་བཞིན་ཞེས་བྱ་བ་ལ་སོགས་པའོ།
en: Just as suchness will, Subhūti”— teaching all dharmas later in a state that cannot be apprehended— “just as the self element,” and so on, will. “

source: །རབ་འབྱོར་གདགས་སུ་མེད་པའོ་ཞེས་བྱ་བ་ནི་བརྗོད་དུ་མེད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Subhūti, the perfection of wisdom cannot be labeled” means it is inexpressible. “

source: །རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས་སེམས་ཅན་དུ་གདགས་པ་དམིགས་སུ་ཡོད་དམ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་སེམས་ཅན་དམྱལ་བ་ལ་སོགས་པས་ཀུན་བརྟགས་པའི་ཕྱིར་མེད་པ་ལས་ཀུན་རྫོབ་ཏུ་བཏགས་པ་སྟེ།
en: Subhūti, what do you think, can a being that is a label be apprehended?”

source: བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ལ་ཕན་གདགས་པའི་ཕྱིར་རོ་ཞེས་བསྟན་པའོ།
en: and so on is teaching that hell and so on do not exist because they are falsely imagined phenomena, but they are labeled conventionally for the benefit of ordinary fools. “

source: །དབྲི་བ་མེད་པ་དང་བསྣན་པ་མེད་པར་ཞེས་བྱ་བ་ནི་ཡོད་པ་ལ་སྐུར་པ་འདེབས་པ་ནི་དབྲི་བའོ། །མེད་པ་ལ་སྒྲོ་འདོགས་པ་ནི་བསྣན་པའོ།
en: Without taking anything away and without adding anything”— over-negation of what exists is “taking away”; over-reification of what does not exist is “adding something.” “

source: །སྐྱེ་བ་མེད་པ་དང་།
en: Subhūti, they should train in those as not produced and not stopping.”

source: འགག་པ་མེད་པ་ལ་བསླབ་པ་ཞེས་བྱ་བ་སྐྱེ་བ་མེད་པའི་བསླབ་པ་ནི་གང་སྒྲོ་འདོགས་པ་མེད་པའོ།
en: Training “as not produced” is without over-reification; training “as not stopping” is without over-negation. “

source: །འགག་པ་མེད་པའི་བསླབ་པ་ནི་ཡོད་པ་ལ་གང་སྐུར་པ་འདེབས་པ་མེད་པའོ། །བསྒོམ་པར་ཡང་མི་བགྱི།
en: Without meditating on and without investigating” is training in not occasioning anything.

source: རྣམ་པར་གཞིག་པ་ཡང་མི་བགྱི་ཞེས་བྱ་བ་ནི་མངོན་པར་འདུ་བྱེད་པ་མེད་པ་ལ་སློབ་པ་སྟེ། བསྒོམ་པར་བྱ། བསྐྱེད་པར་བྱ་སྙམ་པའི་མངོན་པར་འདུ་བྱེད་པ་མེད་པས་སྐྱེ་བ་མེད་པའི་བསླབ་པའོ། །རྣམ་པར་གཞིག་པར་བྱ་མེད་པར་བྱ་སྙམ་པའི་མངོན་པར་འདུ་བྱེད་པ་མེད་པས་འགག་པ་མེད་པའི་བསླབ་པའོ།
en: It is training that is not produced, because of not occasioning anything by thinking, “I should meditate, I should produce something”; and it is training that does not stop because of not occasioning anything by thinking, “I should destroy,” should make something nonexistent. “

source: །གཟུགས་ནི་གཟུགས་ཀྱིས་སྟོང་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པའི་གཟུགས་ནི་གཟུགས་ཉིད་དུ་མེད་པའོ། །གཟུགས་ཀྱི་མཚན་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ།
en: Form as empty of form”— falsely imagined form does not exist in form itself because it is empty of the defining mark of form. “

source: །སྤྱོད་པ་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའོ་ཞེས་བྱ་བ་ནི་ཐམས་ཅད་དམིགས་སུ་མེད་པའི་ཕྱིར་གང་ལ་ཡང་མི་སྤྱོད་པ་ཉིད་སྤྱོད་པའོ།
en: Not practicing is the bodhisattvas’ practice of the perfection of wisdom”— not practicing anything is the practice, because nothing can be apprehended. “

source: །གལ་ཏེ་སྤྱོད་པ་མ་མཆིས་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལགས་ན་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཇི་ལྟར་སྤྱད་པར་བགྱི་ཞེས་ཞུས་པ་དང་།
en: If not practicing is the practice of the perfection of wisdom, how then will bodhisattva great beings who are beginning the work practice the perfection of wisdom?”

source: ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔས་ཞེས་བྱ་བ་ནི་ལ་སོགས་པས་སེམས་དང་པོ་བསྐྱེད་པ་ནས་བཟུང་སྟེ། མི་དམིགས་པའི་ཚུལ་དུ་ཆོས་ཐམས་ཅད་ལ་བསླབ་པར་བྱའོ་ཞེས་བྱ་བ་སྟེ། ལས་དང་པོ་པ་ལ་དོན་དམ་པའི་སྤྱོད་པ་མེད་དུ་ཟིན་ཀྱང་དེའི་ཕྱིར་བསླབ་པར་བྱ་སྟེ། བསླབ་པ་ཉིད་སྤྱད་པ་ཡིན་ནོ་ཞེས་བསྟན་ཏོ།
en: This is the question, and “bodhisattva great beings beginning the work,” and so on, “starting from the first production of the thought… train in all phenomena as providing no basis for apprehension” teaches that those beginning the work do not have a practice of the ultimate, but still they should train for it, so just that training is the practice. “

source: །བཅོམ་ལྡན་འདས་ཅི་དམིགས་སུ་མཆིས་པ་མི་དམིགས་པ་ལགས་སམ་ཞེས་བྱ་བ་ནི་མི་དམིགས་པ་དམིགས་སུ་མཆིས་སམ་ཞེས་ཞུས་པའོ།
en: Lord… does the findable provide a basis for not apprehending?” This is asking, “Is a basis for not apprehending findable?”

source: །དམིགས་སུ་མེད་པའི་ངོ་བོ་ཉིད་དམིགས་སུ་མེད་པས། དམིགས་སོ་ཞེས་བརྗོད་དུ་མི་རུང་བའི་ཕྱིར་དམིགས་སུ་ཡོད་པ་མི་དམིགས་པ་ཡང་མ་ཡིན་ཞེས་བྱ་བས་བསྩལ་བ་གསུངས་ཏེ།
en: An unfindable intrinsic nature is unfindable so it cannot be said that “it provides a basis for apprehending,” therefore it says that it does not, with “neither does the findable provide a basis for not apprehending.”

source: དམིགས་སུ་མེད་པའི་མཚན་ཉིད་ཆོས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ཡོད་པའི་ཕྱིར་མི་དམིགས་པ་དམིགས་སུ་མེད་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means there is a sameness to all dharmas that are marked as being unfindable, so the absence of a basis for apprehending is not unfindable. “

source: །དམིགས་པ་དང་མི་དམིགས་པ་མཉམ་པ་ཉིད་ནི་མི་དམིགས་པ་སྟེ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་དམིགས་སུ་ཡོད་པ་དངོས་པོ་གང་ཡིན་པ་དང་།
en: The sameness of the findable and the unfindable is the unfindable.”

source: ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པ་དངོས་པོ་མེད་པ་གང་ཡིན་པ་དེ་གཉི་ག་ཡང་མཚུངས་སོ།
en: The existent thing when all dharmas are findable and the nonexistent thing when all dharmas are unfindable are both comparable.

source: ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར་ཏེ།
en: Because they are without an intrinsic nature.

source: དམིགས་སུ་ཡོད་པ་ནི་ཀུན་བརྟགས་པ་ཡིན་པས་ངོ་བོ་ཉིད་མེད་དོ། །དམིགས་སུ་མེད་པ་ཡང་དངོས་པོ་མེད་པའི་བདག་ཉིད་ཡིན་པས་ངོ་བོ་ཉིད་མེད་དེ། དེ་བས་ན་གཉི་ག་ཡང་ངོ་བོ་ཉིད་མེད་པར་མཚུངས་ཏེ།
en: The findable is falsely imagined and hence without an intrinsic nature, and the unfindable is in the form of a nonexistent thing and hence without an intrinsic nature too, so both are comparable as being without an intrinsic nature.

source: དམིགས་སུ་ཡོད་པ་དང་། དམིགས་སུ་མེད་པ་དེ་གཉིས་ཀྱི་མཉམ་པ་ཉིད་ངོ་བོ་ཉིད་མེད་པ། གང་ཡིན་པ་དེ་ནི་དམིགས་སུ་མེད་པའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means the sameness of both the findable and unfindable, that absence of an intrinsic nature, is the unfindable. “

source: །ཇི་ལྟར་ས་ནས་ས་ཡོངས་སུ་རྫོགས་པར་བགྱི།
en: How… will… [they] complete level after level, and how… will they reach the knowledge of all aspects?”

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཇི་ལྟར་ཐོབ་པར་བགྱི་ཞེས་བྱ་བ་ནི་གལ་ཏེ་དམིགས་པ་ལ་ཆགས་པར་མ་གྱུར་ན། གོང་ནས་གོང་མའི་ས་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཇི་ལྟར་བརྩོན་པར་བྱ་ཞེས་དགོངས་པའོ། །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དམིགས་སུ་མེད་ཅེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་བསྟན་ཏེ། དམིགས་པ་དང་བཅས་པའི་ངོ་བོ་ཉིད་ཀྱིས།
en: This intends to say that if they are not attached to what provides a basis for apprehending, how will they work hard at level after level and the knowledge of all aspects? “

source: ས་གོང་མའམ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་འགྱུར་གྱི། ཇི་ལྟ་ཇི་ལྟར་དམིགས་སུ་མེད་པ་མཐུ་དང་ལྡན་པར་གྱུར་པ་དེ་ལྟ་དེ་ལྟར་ས་གཞན་ནས་གཞན་དུ་འཕར་བ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་ཏེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བྱང་ཆུབ་དང་།
en: Subhūti… a perfection of wisdom cannot be apprehended,” and so on, teaches that with a findable intrinsic nature a higher level or the knowledge of all aspects would not be reached, but because the perfection of wisdom, awakening, and a bodhisattva are in their nature unfindable, as the absence of apprehending gets stronger and stronger there is an ascent from one level to the other and they reach the knowledge of all aspects. “

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དམིགས་སུ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཕྱིར་རོ་ཞེས་སྟོན་ཏོ།
en: How will [they]… make an investigation into… all these dharmas that are without an intrinsic nature?”

source: །ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་དང་བྲལ་བ་ལ་ཇི་ལྟར་རབ་ཏུ་རྣམ་པར་དབྱེ་བར་བགྱི་ཞེས་བྱ་བ་ནི་གལ་ཏེ་ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་དང་བྲལ་བ་ཡིན་ན། འདི་ནི་གཟུགས་སོ། །འདི་ནི་ཚོར་བའོ་ཞེས་བྱ་བ་ལ་སོགས་པར་རབ་ཏུ་རྣམ་པར་དབྱེ་བར་ཇི་ལྟར་བྱེད་ཅེས་བྱ་བའོ།
en: If all dharmas are without an intrinsic nature, how will they make an investigation into “ ‘this is form, this is feeling,’ ” and so on? “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཇི་ལྟར་ན་བྱས་པས་གཟུགས་དམིགས་པར་འགྱུར་བ་དེ་ལྟར་ཆོས་རྣམས་རབ་ཏུ་རྣམ་པར་འབྱེད་པར་མི་བྱེད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་བསྟན་ཏེ། བྱང་ཆུབ་སེམས་དཔས་ནི་གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་མི་དམིགས་ཏེ། ཇི་ལྟ་ཇི་ལྟར་སྒྲུབ་པ་དེ་ལྟ་དེ་ལྟར་མི་དམིགས་སོ། །དེ་བས་ན་དམིགས་སུ་མེད་པའི་དོན་ལ་རབ་ཏུ་འཇུག་གོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་གཟུགས་ཀྱང་མི་དམིགས་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་གསོལ་ཏེ།
en: Subhūti… bodhisattvas… who do it in such a way that they apprehend form… do not make an investigation into dharmas,” and so on, teaches that bodhisattvas do not apprehend any dharmas, form and so on.

source: གལ་ཏེ་དམིགས་སུ་མེད་པའི་དོན་ལ་རབ་ཏུ་ཞུགས་པ་ཡིན་ན། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་། སྐྱོན་མེད་པར་འཇུག་པ་དང་། ཞིང་ཡོངས་སུ་དག་པར་བྱ་བ་དང་།
en: As they progress more and more, they apprehend less and less and thereby enter into an unfindable reality. “

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། མངོན་པར་བྱང་ཆུབ་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། སངས་རྒྱས་ཀྱི་མཛད་པ་དང་། སེམས་ཅན་རྣམ་པར་གྲོལ་བར་བྱ་བ་ལ་སོགས་པ་དམིགས་པའི་སྦྱོར་བ་རྣམས་ཇི་ལྟར་གྲུབ་པར་འགྱུར་ཞེས་ཞུས་པའོ།
en: Lord, if [they]… do not apprehend form,” and so on, is asking: how, if they have entered into an unfindable reality, will they accomplish practices that apprehend a basis—the completion of the perfections, entry into the secure state of a bodhisattva, purification of a buddhafield, bringing beings to maturity, awakening, turning the wheel of the Dharma, the work of a buddha, and freeing all beings? “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་ནི་གཟུགས་ཀྱི་དོན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མི་སྤྱོད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་བསྟན་ཏེ། བྱང་ཆུབ་སེམས་དཔས་ནི་གཟུགས་ལ་སོགས་པའི་ཆོས་རྣམས་ལ་མི་སྤྱོད་ཀྱི། ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་རོ་སྤྱོད་དོ་ཞེས་བྱ་བ་སྟེ།
en: Subhūti, bodhisattva great beings do not practice the perfection of wisdom for the sake of form,” and so on, teaches that bodhisattvas do not practice the dharmas, form and so on, but rather practice for the state in which all dharmas are unfindable.

source: སྔར་བཤད་པའི་དམིགས་སུ་ཡོད་པ་ནི་ཀུན་རྫོབ་ཀྱི་ཐ་སྙད་ཡིན་གྱི། དོན་དམ་པར་ནི་མ་ཡིན་ནོ་ཞེས་བསྟན་པའོ།
en: The earlier explanation was teaching that they were findable conventionally as designations, not ultimately.

source: །མ་བྱས་པ་འགྱུར་བ་མེད་པ་ཞེས་བྱ་བའི་དོན་ནི་སྔར་བཤད་ཟིན་ཏོ།
en: I have explained the meaning of “unmade, unchanging” before. “

source: །ཐེག་པ་གསུམ་པོ་དག་ཇི་ལྟར་རྣམ་པར་དགོད་པར་འགྱུར་ཞེས་བྱ་བ་ནི་གལ་ཏེ་ཆོས་ཐམས་ཅད་མ་བྱས་པ།
en: How is there an arrangement of three vehicles?”

source: འགྱུར་བ་མེད་པ་ཡིན་ན། ཐེག་པ་གསུམ་དུ་དབྱེ་བ་མེད་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: means that if all dharmas are unmade and unchanging there will be no division into three vehicles. “

source: །རབ་འབྱོར་མ་བྱས་པ་དང་། འགྱུར་བ་མེད་པའི་ཆོས་རྣམས་ལ་ནི་རྣམ་པར་དགོད་པ་གང་ཡང་དམིགས་སུ་མེད་དེ་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པའི་ཐེག་པ་རྣམ་པར་དགོད་པ་དག་དོན་དམ་པར་ཡོད་པ་མ་ཡིན་ནོ་ཞེས་དགོངས་པའོ།
en: Subhūti, no arrangement at all can be apprehended in dharmas that are unmade and unchanging” intends that the falsely imagined arrangement of vehicles does not ultimately exist.

source: །འདིར་ཞུས་པ་དང་ལན་བཏབ་པ་དག་གོ་སླ་བས་རྣམ་པར་མ་བཀྲོལ་ལོ།
en: Here the questions and answers are easy to understand so they have not been explained in detail. “

source: །ངས་ནི་འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་ཡང་དག་པ་མ་ཡིན་པ་ལས་འཛིན་པ་ལས་ཟློག་གི་དོན་དམ་པར་ནི་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་དོན་དམ་པར་ཕུང་པོ་གསུམ་དུ་གཏོགས་པའི་སེམས་ཅན་གང་ཡང་དམིགས་སུ་མེད་ཀྱི།
en: As an ordinary convention, but not ultimately, I keep these beings… away from seizing on the unreal.” It is saying that ultimately any beings included in the three groups are unfindable.

source: དེ་དག་ཡང་དག་པ་མ་ཡིན་པའི་ཆོས་རྣམས་ལ་ཡང་དག་པར་འཛིན་པ་ལས་འཇིག་རྟེན་གྱི་ཀུན་རྫོབ་ཏུ་སླར་ལྡོག་པར་ཟད་དེ། མིང་དེས་ཐ་སྙད་དུ་འདོགས་ཀྱི། དོན་དམ་པར་ནི་མ་ཡིན་ནོ་ཞེས་བྱ་བའོ།
en: They are simply designated conventionally with those names, simply as an ordinary convention, not ultimately, to stop them seizing on unreal dharmas as real. “

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དོན་དམ་པ་ལ་བཞུགས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སམ་ཞེས་ཞུས་པ་ལ།
en: But Lord, the tathāgatas stood in the ultimate and fully awakened to unsurpassed, perfect, complete awakening.”

source: དོན་དམ་པར་གནས་མེད་པ་དང་། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ་བ་མེད་པའི་ཕྱིར་རབ་འབྱོར་དེ་ནི་མ་ཡིན་ནོ་ཞེས་བསྩལ་བ་གསུངས་སོ།
en: He responds in the negative to this question with “no, Subhūti,” because ultimately there is no standing and there is no full awakening. “

source: །འོ་ན་རྫུ་འཕྲུལ་གྱི་རྣམ་གྲངས་ལ་བཞུགས་ཏེ་འམ་ཞེས་བྱ་བ་ནི་གལ་ཏེ་དོན་དམ་པ་ལ་མ་ཡིན་ན། འོ་ན་སྤྲུལ་པས་སམ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Well then, the tathāgatas stood in a succession of miraculous powers and fully awakened” means if not ultimately, well then, as magical creations?

source: །དེ་ཡང་ཤིན་ཏུ་མེད་པའི་ཕྱིར་ལན་གསུངས་ཏེ།
en: Again, the answer he gives is because they absolutely do not exist.

source: བརྗོད་དུ་མེད་པའི་བདག་ཉིད་དང་། སོ་སོར་རང་གིས་རིག་པའི་རྣམ་པས་ཆོས་ཐམས་ཅད་རྟོགས་པ་ནི་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པའོ།
en: A realization inexpressible in its nature and in the form of self-reflexive analytic knowledge of all dharmas is complete awakening.

source: །འདིར་ཡང་ཅི་ཁྱོད་དོན་དམ་པ་ལ་ཞུགས་ཏེ་འམ་རྫུ་འཕྲུལ་གྱི་རྣམ་གྲངས་ལ་ཞུགས་ཏེ་འམ་ཞེས་ཅིའི་ཕྱིར་ཁྱོད་གནས་འདྲི་བར་བྱེད་ཅེས་དགོངས་པའོ།
en: He intends this: “And so why do you still inquire if they stand in the ultimate, or if they stand in a succession of miraculous powers?”

source: །དེ་ནི་འདུས་བྱས་ཀྱི་ཁམས་སམ་འདུས་མ་བྱས་ཀྱི་ཁམས་གང་ལ་ཡང་གནས་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ལ་སོགས་པས་བྱང་ཆུབ་ཀྱང་གང་ལ་ཡང་གནས་པ་མ་ཡིན་པར་བསྟན་ཏེ།
en: With “but do not stand in the compounded element or the uncompounded element,” and so on, it teaches that even “awakening” is not anywhere at all.

source: དེ་བཞིན་གཤེགས་པས་སྤྲུལ་པའི་དཔེས་བསྟན་ཏོ།
en: It explains that with the analogy of a tathāgata’s magical creation.

source: །རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དང་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་ལ་ཁྱད་པར་མེད་དོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་ལས་བྱེད་དོ་ཞེས་བྱ་བ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ན། གང་གི་ཚེ་བདག་ཅག་གི་བཅོམ་ལྡན་འདས་བྱམས་པ་ལ། ཁྱོད་ཀྱིས་ང་འདས་པའི་འོག་ཏུ་སངས་རྒྱས་ཀྱི་བྱ་བ་བྱས་ནས་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱོས་ཤིག་ཅེས་བྱ་བར་ལུང་བསྟན་དུ་འོས་པ་ལྟ་བུའི་བྱང་ཆུབ་སེམས་དཔའ་མ་གཟིགས་པ་དེའི་ཚེ།
en: As for, “Subhūti, there is no distinction… between a tathāgata and a tathāgata’s magical creation,” and “the magical creation does the work,” the Lord Buddha was passing into complete nirvāṇa and at that time he did not see a bodhisattva like our lord Maitreya suitable for a prophecy, to whom he could say, “After I have passed away, do the work of a buddha and work for the welfare of beings.”

source: ཉིད་ཀྱི་སྐུ་དང་མཚུངས་པ་གཟུགས་ཕུན་སུམ་ཚོགས་པའི་སྤྲུལ་པ་སྤྲུལ་ནས་ཁྱོད་སངས་རྒྱས་ཀྱི་བྱ་བ་བྱོས་ཤིག་ཅེས་བཀའ་སྩལ་ཏེ།
en: He therefore emanated a magically created perfect form comparable to his own body and said to it, “You must do the work of a buddha.”

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དེའི་ཚེ།
en: He then passed into nirvāṇa.

source: དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་དེ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་སངས་རྒྱས་ཀྱི་མཛད་པ་མཛད་དེ། སེམས་ཅན་རྣམས་ལ་ཕན་འདོགས་སོ།
en: When he had done so the Tathāgata’s magical creation did the work of the Buddha in all world systems and benefited beings.

source: །གང་གི་ཚེ་ལུང་བསྟན་དུ་འོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་གཟིགས་པ་དེའི་ཚེ། སེམས་ཅན་རྣམས་དེའི་ལག་ཏུ་གཏད་ནས་ཉིད་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟོན་ཏེ།
en: When that magical creation saw a bodhisattva suitable for a prophesy, he entrusted beings into that bodhisattva’s hands and demonstrated complete nirvāṇa.

source: སྤྲུལ་པ་དེ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་བྱེ་བྲག་ཅུང་ཟད་ཀྱང་མེད་དོ།
en: Between that magical creation and a tathāgata there is no difference at all.

source: །ཆོས་ཉིད་དེ་ཉིད་ཀྱི་སྤྲུལ་པ་ཡང་ཞེས་བྱ་བ་ནི་གཉི་ག་ཡང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་པ་དང་།
en: It says “the true nature of dharmas on account of which the magical creation…” because they are both the nonexistence of an intrinsic nature.

source: སེམས་ཅན་ལ་ཕན་པ་ཉིད་ཀྱི་ཕྱིར་བྱུང་བ་དང་། དེའི་མཛད་པ་མཛད་པའི་ཕྱིར་དེ་སྐད་དུ་བཤད་དོ།
en: Both come about just in order to benefit beings, and both do their work. “

source: །དེའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་དཀྲུགས་པར་མ་གྱུར་ཏམ་ཞེས་བྱ་བ་ནི་མེད་པའི་ཆོས་རྣམས་ཡོད་པ་ཉིད་དུ་བཤད་པའི་ཕྱིར་རོ།
en: But has the Lord not complicated the true dharmic nature of all dharmas” by explaining nonexistent dharmas as being existent? “

source: །རབ་འབྱོར་ངས་ནི་མིང་དང་མཚན་མས་ཆོས་རྣམས་བསྟན་ཏེ་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་བྱིས་པའི་ཡོངས་སུ་རྟོག་པ་ཞལ་གྱིས་བཞེས་ཀྱི་གཞན་དུ་སླ་བ་མ་ཡིན་པས་དེ་སྐད་བརྗོད་དོ།
en: Subhūti, I have taught… dharmas with words and signs.” He accepts the ideas of simple folk as ordinary convention. He has explained like that; otherwise, it would not be easy. “

source: །མིང་དང་མཚན་མ་ལ་མངོན་པར་ཞེན་པ་མེད་དོ་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་པ་རྣམས་ལ།
en: There is no settling down to do with names and signs.”

source: རྣམ་པ་གཞན་གྱིས་གོ་བར་བྱ་མི་ནུས་ཤིང་དཀའ་བའི་ཕྱིར་དེ་དང་མཐུན་པའི་ཀུན་རྫོབ་ཀྱི་ཐ་སྙད་དུ་བྱས་ཀྱི།
en: He uses conventional designations that are in accord with ordinary people because they are incapable of understanding in other ways. It is difficult for them.

source: མངོན་པར་ཞེན་པ་མེད་པས་ཉེས་པ་མེད་དོ།
en: There is no settling down on them, however, so there is no fault.

source: །གལ་ཏེ་འདི་ནི་བདེན་པའོ་ཞེས་མངོན་པར་ཞེན་པ་དེའི་ཕྱིར་ཉེས་པར་འགྱུར་རོ་ཞེས་བསྟན་ཏོ།
en: This is teaching that were they to settle down, thinking “this is true,” then there would be a fault. “

source: །རབ་འབྱོར་རྣམ་པ་གལ་ཏེ་མིང་མིང་ལ་མངོན་པར་ཞེན་པར་འགྱུར་རམ། མཚན་མ་མཚན་མ་ལ་མངོན་པར་ཞེན་པར་འགྱུར་ན་ནི་ཞེས་བྱ་བ་ནི་གལ་ཏེ་མིང་མིང་ལ་མངོན་པར་ཞེན་པར་འགྱུར་རམ། མཚན་མ་མཚན་མ་ལ་མངོན་པར་ཞེན་པར་འགྱུར་ན། དེ་ལྟ་ན་ནི་སྟོང་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་ལ་མངོན་པར་ཞེན་པར་འགྱུར་རོ། །དེ་བཞིན་དུ་མཚན་མ་མེད་པ་ལ་སོགས་པ་ཡང་མངོན་པར་ཞེན་པར་འགྱུར་བ་ཞིག་ན།
en: Subhūti, were a name to settle down on a name, or were a sign to settle down on a sign”— if names settled down on names or if causal signs settled down on causal signs, then “emptiness would settle down on emptiness,” and similarly, “signlessness” and so on would settle down.

source: འདི་ལྟར་སྟོང་པ་ཉིད་ལ་སོགས་པ་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་མངོན་པར་ཞེན་པར་མི་འགྱུར་རོ།
en: Thus, it is saying that emptiness and so on do not settle down because they are the nonexistence of an intrinsic nature.

source: །དེ་བཞིན་དུ་སངས་རྒྱས་དང་། ཉན་ཐོས་རྣམས་ཀྱང་མངོན་པར་ཞེན་པར་མི་འགྱུར་རོ་ཞེས་གསུངས་པའོ།
en: Similarly, buddhas and śrāvakas do not settle down. “

source: །རབ་འབྱོར་འདི་ལྟར་ཆོས་ཐམས་ཅད་མིང་དང་།
en: Subhūti, all dharmas are thus simply mere names.”

source: མཚན་མ་ཙམ་དུ་ཟད་དོ་ཞེས་བྱ་བ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་མིང་དང་། མཚན་མ་ཙམ་དུ་ཟད་ན། འཇིག་རྟེན་རྣམས་ཀྱིས་དེ་ལྟར་མི་ཤེས་ཏེ།
en: Thus, while all dharmas are simply mere names and signs, those in the world do not know them as such.

source: དེ་བས་ན་དེ་དག་གིས་རྟོགས་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སྤྱོད་པར་འགྱུར་རོ།
en: Therefore, bodhisattvas practice so that they will come to that realization.

source: །འདི་ལྟར་ཆོས་ཐམས་ཅད་མིང་དང་མཚན་མ་ཙམ་དུ་ཟད་དེ། དེའི་ཕྱིར་དེ་དག་རྟོགས་པས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་རོ།
en: Thus, all dharmas are simply mere names and signs and they reach the knowledge of all aspects by realizing them.

source: །གལ་ཏེ་ཆོས་འགའ་ཞིག་དངོས་པོ་ཡོད་ན། དེ་ལྟ་ན་ནི་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་མི་འགྱུར་རོ་ཞེས་བསྟན་པའོ།
en: This is teaching that were any dharma to be an existent thing then there would be no complete awakening.

source: །རབ་འབྱོར་ཐམས་ཅད་ཤེས་པ་ཉིད་ཅེས་བྱ་བ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིའོ། །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིའོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིའོ་ཞེས་བྱ་བ་ལ།
en: The three knowledges “Subhūti, all-knowledge belongs to śrāvakas and pratyekabuddhas, the knowledge of path aspects… to bodhisattva great beings, and the knowledge of all aspects… to tathāgatas, worthy ones, perfectly complete buddhas.”

source: དེ་ལ་ཐམས་ཅད་ཤེས་པ་ཉིད་ཅེས་བྱ་བ་ནི་འདུས་བྱས་ཐམས་ཅད་མི་རྟག་པའོ། །ཟག་པ་དང་བཅས་པ་ཐམས་ཅད་སྡུག་བསྔལ་བའོ། །ཆོས་ཐམས་ཅད་བདག་མེད་པའོ་ཞེས་ཐམས་ཅད་ཤེས་པ་ཉིད་རྣམ་པ་གསུམ་གྱིས་ཞུགས་ནས་ཆོས་དང་རྗེས་སུ་རྟོག་པའི་ཤེས་པའི་དབང་གིས་ཆོས་ཐམས་ཅད་ཀྱི་མཐར་གཏུགས་པའི་ཤེས་པ་ནི་ཐམས་ཅད་ཤེས་པ་ཞེས་བྱ་སྟེ།
en: Among these, “all-knowledge”: Beginning as the three forms of the knowledge of all those who know that “all compounded phenomena are impermanent; all contaminated phenomena are suffering; all phenomena are without a self,” all-knowledge is the definitive knowledge of all dharmas based on dharma and subsequent realization knowledge.

source: ཤེས་པ་དེ་ཡང་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་ཤེས་པ་ནི་མ་ཡིན་གྱི།
en: That knowledge, furthermore, is not knowledge of all dharmas in all aspects.

source: མཚན་ཉིད་གསུམ་དང་། བདེན་པ་བཞིའི་སྒོ་ནས་ཆོས་ཐམས་ཅད་ལ་རྨོངས་པ་མེད་པའི་ཕྱིར་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་ཤེས་པ་ལ་ཐམས་ཅད་ཤེས་པ་ཉིད་ཅེས་བྱའོ།
en: The knowledge of śrāvakas and pratyekabuddhas is called all-knowledge because by way of the three marks and four truths they are not perplexed about all dharmas. “
